Revit 2026 API

# WaterLoopType Enumeration

---

The type of water loop.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WaterLoopType
```
```vb
Public Enumeration WaterLoopType
```
```cpp
public enum class WaterLoopType
```
```fsharp
type WaterLoopType
```

| Member name | Value | Description |
| --- | --- | --- |
| ChilledWater | 1 |  |
| CondenserWater | 2 |  |
| HotWater | 3 |  |
| Undefined | 0 |  |
| VRF | 4 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace